#!/usr/bin/env bash
#
# nomeDoScript.sh - Breve descrição
#
# Site:       https://seusite.com
# Autor:      Seu nome
# Manutenção: Seu nome ou outro
#
# ------------------------------------------------------------------------- #
# Aqui você deve utilizar uma descrição mais detalhada sobre o seu programa,
# explicando a forma de utilizar.
#
# Exemplos:
#     $ ./nomeDoScript.sh -d 1
#     Neste exemplo o script será executado no modo debug nível 1.
# ------------------------------------------------------------------------- #
# Histórico:
#
# v1.0 25/05/2019, Autor da mudança:
#     - O que mudou?
# v1.1 26/05/2019, Autor da mudança:
#     - O que mudou?
# ------------------------------------------------------------------------- #
# Testado em:
#   bash 4.4.19
# ------------------------------------------------------------------------- #
# Agradecimentos:
#
#   Joãozinho - Encontrou um bug na parte de login.
#   Mariazinha - Enviou uma sugestão de adicionar o -h.
# ------------------------------------------------------------------------- #

# -------------------------- VARIÁVEIS ------------------------------------ #

# ------------------------------------------------------------------------- #

# -------------------------- TESTES --------------------------------------- #

# ------------------------------------------------------------------------- #

# -------------------------- FUNÇÕES -------------------------------------- #

# ------------------------------------------------------------------------- #

# -------------------------- EXECUÇÃO ------------------------------------- #

# ------------------------------------------------------------------------- #

